In [1]:
# import dependencies
import pandas as pd

## Cleanup on population csv

In [2]:
# read in csv
population = pd.read_csv("resources/StatesPopulation2010-2016.csv")

# drop unused rows
population = population.drop(index=[0,1,2,3,4,56])

# get rid of "." and ","
population["Geographic Area"] = population["Geographic Area"].replace("\.","",regex=True)
population = population.replace(",","",regex=True)

# rename colums, set index to states
population = population.rename(columns={"Geographic Area":"state"}).sort_values("state")
population.set_index("state",inplace=True)

population.head()

,2010,2011,2012,2013,2014,2015,2016
state,,,,,,,
Alabama,4785492,4799918,4815960,4829479,4843214,4853875,4863300
Alaska,714031,722713,731089,736879,736705,737709,741894
Arizona,6408312,6467163,6549634,6624617,6719993,6817565,6931071
Arkansas,2921995,2939493,2950685,2958663,2966912,2977853,2988248
California,37332685,37676861,38011074,38335203,38680810,38993940,39250017

## Cleanup on housing csv

In [3]:
# read in csv
housing_price = pd.read_csv("resources/StateHousingPriceSince1996.csv")

# get 2010-2016 data
housing_price = housing_price.filter(regex="Region|2010|2011|2012|2013|2014|2015|2016")

# sum up to get price for whole year instead of seperate months
years=["2010","2011","2012","2013","2014","2015","2016"]
for year in years:
    housing_price[year]=housing_price.filter(regex=year).mean(axis=1)
    housing_price[year]=housing_price[year].map("{:.2f}".format)

# pick up columns, rename, set index to states
housing_price = housing_price[["RegionName","2010","2011","2012","2013","2014","2015","2016"]]
housing_price = housing_price.rename(columns={"RegionName":"state"}).sort_values("state").set_index("state")

housing_price.head()

,2010,2011,2012,2013,2014,2015,2016
state,,,,,,,
Alabama,119350.00,117116.67,117058.33,116558.33,117858.33,119841.67,122475.00
Alaska,242975.00,241341.67,241933.33,247508.33,252708.33,258750.00,265383.33
Arizona,153666.67,137158.33,146666.67,170316.67,184525.00,194908.33,210158.33
Arkansas,104933.33,103233.33,103191.67,106375.00,107933.33,109650.00,113416.67
California,334841.67,314650.00,315450.00,369108.33,412975.00,439366.67,470575.00

## Cleanup on crime csv

In [4]:
# read in csv
crime_rate = pd.read_csv("resources/crime_rates_state.csv")

# rename colums
crime_rate = crime_rate.rename(columns={"MURDER RATES PER 100,000 PEOPLE\xa0":"state",
                                        "Unnamed: 1":"2016","Unnamed: 2":"2015","Unnamed: 3":"2014","Unnamed: 4":"2013",
                                        "Unnamed: 5":"2012","Unnamed: 6":"2011","Unnamed: 7":"2010"})

# drop unecessary rows
crime_rate = crime_rate.drop(index=[0,1])

# set index
crime_rate = crime_rate.sort_values(["state"]).set_index(["state"])

# select columns for using
crime_rate = crime_rate[["2010","2011","2012","2013","2014","2015","2016"]]

crime_rate.head()

            2010  2011  2012  2013  2014  2015  2016
state
Alabama      5.7   6.2   7.1   7.2   5.7   7.2   8.4
Alaska       4.3   4.1   4.1   4.6   5.6   8.0   7.0
Arizona      6.4   6.1   5.5   5.4   4.7   4.5   5.5
Arkansas     4.6   5.4   5.9   5.4   5.6   6.3   7.2
California   4.8   4.8   5.0   4.6   4.4   4.8   4.9

## Find missing states

In [5]:
for name in population.index.values:
    if name not in crime_rate.index.values:
        print(name)

District of Columbia
Puerto Rico

In [6]:
for name in population.index.values:
    if name not in housing_price.index.values:
        print(name)

Louisiana
Puerto Rico
Vermont

## Create connection to database

In [7]:
# dependencies
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()

In [8]:
# load credentials
from config import username,password

In [9]:
engine = create_engine(f'mysql://{username}:{password}@localhost/etl_project')

In [10]:
engine.table_names()

['crit_scores', 'math_scores']

## Additional transformation

In [11]:
population.reset_index(inplace=True)
housing_price.reset_index(inplace=True)
crime_rate.reset_index(inplace=True)

In [12]:
population.head()

,state,2010,2011,2012,2013,2014,2015,2016
0,Alabama,4785492,4799918,4815960,4829479,4843214,4853875,4863300
1,Alaska,714031,722713,731089,736879,736705,737709,741894
2,Arizona,6408312,6467163,6549634,6624617,6719993,6817565,6931071
3,Arkansas,2921995,2939493,2950685,2958663,2966912,2977853,2988248
4,California,37332685,37676861,38011074,38335203,38680810,38993940,39250017

In [13]:
housing_price.head()

,state,2010,2011,2012,2013,2014,2015,2016
0,Alabama,119350.00,117116.67,117058.33,116558.33,117858.33,119841.67,122475.00
1,Alaska,242975.00,241341.67,241933.33,247508.33,252708.33,258750.00,265383.33
2,Arizona,153666.67,137158.33,146666.67,170316.67,184525.00,194908.33,210158.33
3,Arkansas,104933.33,103233.33,103191.67,106375.00,107933.33,109650.00,113416.67
4,California,334841.67,314650.00,315450.00,369108.33,412975.00,439366.67,470575.00

In [14]:
crime_rate.head()

        state  2010  2011  2012  2013  2014  2015  2016
0     Alabama   5.7   6.2   7.1   7.2   5.7   7.2   8.4
1      Alaska   4.3   4.1   4.1   4.6   5.6   8.0   7.0
2     Arizona   6.4   6.1   5.5   5.4   4.7   4.5   5.5
3    Arkansas   4.6   5.4   5.9   5.4   5.6   6.3   7.2
4  California   4.8   4.8   5.0   4.6   4.4   4.8   4.9

## Load dataframes into database

In [15]:
population.to_sql(name='population', con=engine, if_exists='append', index=False)

In [16]:
housing_price.to_sql(name='housing_price', con=engine, if_exists='append', index=False)

In [17]:
crime_rate.to_sql(name='crime_rate', con=engine, if_exists='append', index=False)

## Save as csv files

In [18]:
# dependencies
import os

In [19]:
path = os.path.join('output','population.csv')
population.to_csv(path)

In [20]:
path = os.path.join('output','housing_price.csv')
housing_price.to_csv(path)

In [21]:
path = os.path.join('output','crime_rate.csv')
crime_rate.to_csv(path)